apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_rcc.h
/* Clock Recovery RC register */

#define RCC_CRRCR_HSI48CAL_SHIFT         (0)      /* Bits 9-0: Internal RC 48MHz Clock Calibration */
#define RCC_CRRCR_HSI48CAL_MASK          (0x3ff << RCC_CRRCR_HSI48CAL_SHIFT)

/* CSI Calibration register */

#define RCC_CSICFGR_CSITRIM_SHIFT        (16)      /* Bits 21-16: Internal High Speed clock trimming */
#define RCC_CSICFGR_CSITRIM_MASK         (0x3f << RCC_CSICFGR_CSITRIM_SHIFT)
#define RCC_CSICFGR_CSICAL_SHIFT         (0)      /* Bits 11-0: Internal High Speed clock Calibration */
#define RCC_CSICFGR_CSICAL_MASK          (0xff << RCC_CSICFGR_CSICAL_SHIFT)

/* Clock configuration register 1 */

#define RCC_CFGR1_SW_SHIFT                (0)       /* Bits 0-1: System clock Switch */
#define RCC_CFGR1_SW_MASK                 (3 << RCC_CFGR1_SW_SHIFT)
#  define RCC_CFGR1_SW_MSI                (0 << RCC_CFGR1_SW_SHIFT) /* 00: MSI selected as system clock */
#  define RCC_CFGR1_SW_HSI16              (1 << RCC_CFGR1_SW_SHIFT) /* 00: HSI16 selected as system clock */
#  define RCC_CFGR1_SW_HSE                (2 << RCC_CFGR1_SW_SHIFT) /* 01: HSE selected as system clock */
#  define RCC_CFGR1_SW_PLL                (3 << RCC_CFGR1_SW_SHIFT) /* 10: PLL selected as system clock */

#define RCC_CFGR1_SWS_SHIFT               (3)       /* Bits 3-4: System Clock Switch Status */
#define RCC_CFGR1_SWS_MASK                (3 << RCC_CFGR1_SWS_SHIFT)
#  define RCC_CFGR1_SWS_MSI               (0 << RCC_CFGR1_SWS_SHIFT) /* 00: MSI oscillator used as system clock */
#  define RCC_CFGR1_SWS_HSI16             (1 << RCC_CFGR1_SWS_SHIFT) /* 00: HSI16 oscillator used as system clock */
#  define RCC_CFGR1_SWS_HSE               (2 << RCC_CFGR1_SWS_SHIFT) /* 01: HSE oscillator used as system clock */
#  define RCC_CFGR1_SWS_PLL               (3 << RCC_CFGR1_SWS_SHIFT) /* 10: PLL used as system clock */

#define RCC_CFGR1_STOPWUCK               (1 << 6) /* System clock selection after a wakeup from system stop */
#define RCC_CFGR1_STOPKERWUCK            (1 << 7) /* Kernel clock selection after a wakeup from system stop */

#define RCC_CFGR1_RTCPRE_SHIFT           (8)                            /* Bits 13-8: RTC prescaler */
#define RCC_CFGR1_RTCPRE_MASK            (0x3f << RCC_CFGR1_RTCPRE_SHIFT)
#  define RCC_CFGR1_RTCPRE_HSE           (0 << RCC_CFGR1_RTCPRE_SHIFT)  /* 0xxx: HSE not divided */
#  define RCC_CFGR1_RTCPRE_HSEd2         (2 << RCC_CFGR1_RTCPRE_SHIFT)  /* 10: HSE divided by 2 */
#  define RCC_CFGR1_RTCPRE_HSEd4         (4 << RCC_CFGR1_RTCPRE_SHIFT)  /* 100: HSE divided by 4 */
#  define RCC_CFGR1_RTCPRE_HSEd8         (8 << RCC_CFGR1_RTCPRE_SHIFT)  /* 1000: HSE divided by 8 */
#  define RCC_CFGR1_RTCPRE_HSEd16        (16 << RCC_CFGR1_RTCPRE_SHIFT) /* 10000: HSE divided by 16 */
#  define RCC_CFGR1_RTCPRE_HSEd32        (32 << RCC_CFGR1_RTCPRE_SHIFT) /* 100000: HSE divided by 32 */
#  define RCC_CFGR1_RTCPRE_HSEd63        (63 << RCC_CFGR1_RTCPRE_SHIFT) /* 111111: HSE divided by 63 */

#define RCC_CFGR1_TIMPRE                 (1 << 15) /* timers clocks prescaler selection */

#define RCC_CFGR1_MCO1PRE_SHIFT             (18) /* Bits 21-18: MCO1 Prescaler */
#define RCC_CFGR1_MCO1PRE_MASK              (0xfU << RCC_CFGR1_MCO1PRE_SHIFT)
#define RCC_CFGR1_MCO1PRE(x)                (((x) << RCC_CFGR1_MCO1PRE_SHIFT) & RCC_CFGR1_MCO1PRE_MASK)

#define RCC_CFGR1_MCO1SEL_SHIFT            (22) /* Bits 24-22: Microcontroller Clock Output1 */
#define RCC_CFGR1_MCO1SEL_MASK             (0x7U << RCC_CFGR1_MCO1SEL_SHIFT)
#  define RCC_CFGR1_MCO1SEL_HSI            (0 << RCC_CFGR1_MCO1SEL_SHIFT) /* 0000: HSI clock selected */
#  define RCC_CFGR1_MCO1SEL_LSE            (1 << RCC_CFGR1_MCO1SEL_SHIFT) /* 0001: LSE clock selected */
#  define RCC_CFGR1_MCO1SEL_HSE            (2 << RCC_CFGR1_MCO1SEL_SHIFT) /* 0010: HSE clock selected */
#  define RCC_CFGR1_MCO1SEL_PLL1           (3 << RCC_CFGR1_MCO1SEL_SHIFT) /* 0011: Main PLL1 selected  */
#  define RCC_CFGR1_MCO1SEL_HSI48          (4 << RCC_CFGR1_MCO1SEL_SHIFT) /* 0100: HSI48 clock selected */

#define RCC_CFGR1_MCO2PRE_SHIFT             (25) /* Bits 28-25: MCO2 Prescaler */
#define RCC_CFGR1_MCO2PRE_MASK              (0xfU << RCC_CFGR1_MCO2PRE_SHIFT)
#define RCC_CFGR1_MCO2PRE(x)                (((x) << RCC_CFGR1_MCO2PRE_SHIFT) & RCC_CFGR1_MCO2PRE_MASK)

#define RCC_CFGR1_MCO2SEL_SHIFT            (29) /* Bits 31-29: Microcontroller Clock Output1 */
#define RCC_CFGR1_MCO2SEL_MASK             (0x7U << RCC_CFGR1_MCO2SEL_SHIFT)
#  define RCC_CFGR1_MCO2SEL_SYSCLLK        (0 << RCC_CFGR1_MCO2SEL_SHIFT) /* 0000: Main SYSCLLK selected  */
#  define RCC_CFGR1_MCO2SEL_PLL2           (1 << RCC_CFGR1_MCO2SEL_SHIFT) /* 0001: Main PLL2 selected  */
#  define RCC_CFGR1_MCO2SEL_HSE            (2 << RCC_CFGR1_MCO2SEL_SHIFT) /* 0010: HSE clock selected */
#  define RCC_CFGR1_MCO2SEL_PLL1           (3 << RCC_CFGR1_MCO2SEL_SHIFT) /* 0011: Main PLL1 selected  */
#  define RCC_CFGR1_MCO2SEL_CSI            (4 << RCC_CFGR1_MCO2SEL_SHIFT) /* 0100: CSI clock selected */
#  define RCC_CFGR1_MCO2SEL_LSI            (5 << RCC_CFGR1_MCO2SEL_SHIFT) /* 0101: LSI clock selected */

/* Clock configuration register 2 */

#define RCC_CFGR2_HPRE_SHIFT             (0) /* Bits 3-0: HPRE Prescaler */
#define RCC_CFGR2_HPRE_MASK              (0xf << RCC_CFGR2_HPRE_SHIFT)
#  define RCC_CFGR2_HPRE_SYSCLK          (0 << RCC_CFGR2_HPRE_SHIFT)  /* 0xx: SYSCLK not divided */
#  define RCC_CFGR2_HPRE_SYSCLKd2        (8 << RCC_CFGR2_HPRE_SHIFT)  /* 1000: SYSCLK divided by 2 */
#  define RCC_CFGR2_HPRE_SYSCLKd4        (9 << RCC_CFGR2_HPRE_SHIFT)  /* 1001: SYSCLK divided by 4 */
#  define RCC_CFGR2_HPRE_SYSCLKd8        (10 << RCC_CFGR2_HPRE_SHIFT) /* 1010: SYSCLK divided by 8 */
#  define RCC_CFGR2_HPRE_SYSCLKd16       (11 << RCC_CFGR2_HPRE_SHIFT) /* 1011: SYSCLK divided by 16 */
#  define RCC_CFGR2_HPRE_SYSCLKd64       (12 << RCC_CFGR2_HPRE_SHIFT) /* 1100: SYSCLK divided by 64 */
#  define RCC_CFGR2_HPRE_SYSCLKd128      (13 << RCC_CFGR2_HPRE_SHIFT) /* 1101: SYSCLK divided by 128 */
#  define RCC_CFGR2_HPRE_SYSCLKd256      (14 << RCC_CFGR2_HPRE_SHIFT) /* 1110: SYSCLK divided by 256 */
#  define RCC_CFGR2_HPRE_SYSCLKd512      (15 << RCC_CFGR2_HPRE_SHIFT) /* 1111: SYSCLK divided by 512 */

#define RCC_CFGR2_PPRE1_SHIFT            (4) /* Bits 6-4: PPRE1 Prescaler */
#define RCC_CFGR2_PPRE1_MASK             (0x7 << RCC_CFGR2_PPRE1_SHIFT)
#  define RCC_CFGR2_PPRE1_HCLK1          (0 << RCC_CFGR2_PPRE1_SHIFT)  /* 0xx: HCLK1 not divided */
#  define RCC_CFGR2_PPRE1_HCLK1d2        (4 << RCC_CFGR2_PPRE1_SHIFT)  /* 100: HCLK1 divided by 2 */
#  define RCC_CFGR2_PPRE1_HCLK1d4        (5 << RCC_CFGR2_PPRE1_SHIFT)  /* 101: HCLK1 divided by 4 */
#  define RCC_CFGR2_PPRE1_HCLK1d8        (6 << RCC_CFGR2_PPRE1_SHIFT)  /* 110: HCLK1 divided by 8 */
#  define RCC_CFGR2_PPRE1_HCLK1d16       (7 << RCC_CFGR2_PPRE1_SHIFT)  /* 111: HCLK1 divided by 16 */

#define RCC_CFGR2_PPRE2_SHIFT            (8) /* Bits 10-8: PPRE2 Prescaler */
#define RCC_CFGR2_PPRE2_MASK             (0x7 << RCC_CFGR2_PPRE2_SHIFT)
#  define RCC_CFGR2_PPRE2_HCLK1          (0 << RCC_CFGR2_PPRE2_SHIFT)  /* 0xx: HCLK1 not divided */
#  define RCC_CFGR2_PPRE2_HCLK1d2        (4 << RCC_CFGR2_PPRE2_SHIFT)  /* 1000: HCLK1 divided by 2 */
#  define RCC_CFGR2_PPRE2_HCLK1d4        (5 << RCC_CFGR2_PPRE2_SHIFT)  /* 1001: HCLK1 divided by 4 */
#  define RCC_CFGR2_PPRE2_HCLK1d8        (6 << RCC_CFGR2_PPRE2_SHIFT)  /* 1010: HCLK1 divided by 8 */
#  define RCC_CFGR2_PPRE2_HCLK1d16       (7 << RCC_CFGR2_PPRE2_SHIFT)  /* 1011: HCLK1 divided by 16 */

#define RCC_CFGR2_PPRE3_SHIFT            (12) /* Bits 14-12: PPRE3 Prescaler */
#define RCC_CFGR2_PPRE3_MASK             (0x7 << RCC_CFGR2_PPRE3_SHIFT)
#  define RCC_CFGR2_PPRE3_HCLK1          (0 << RCC_CFGR2_PPRE3_SHIFT)  /* 0xx: HCLK1 not divided */
#  define RCC_CFGR2_PPRE3_HCLK1d2        (4 << RCC_CFGR2_PPRE3_SHIFT)  /* 100: HCLK1 divided by 2 */
#  define RCC_CFGR2_PPRE3_HCLK1d4        (5 << RCC_CFGR2_PPRE3_SHIFT)  /* 101: HCLK1 divided by 4 */
#  define RCC_CFGR2_PPRE3_HCLK1d8        (6 << RCC_CFGR2_PPRE3_SHIFT)  /* 110: HCLK1 divided by 8 */
#  define RCC_CFGR2_PPRE3_HCLK1d16       (7 << RCC_CFGR2_PPRE3_SHIFT)  /* 111: HCLK1 divided by 16 */

#define RCC_CFGR2_AHB1DIS                (1 << 16) /* AHB1 clock disable */
#define RCC_CFGR2_AHB2DIS                (1 << 17) /* AHB2 clock disable */
#define RCC_CFGR2_AHB4DIS                (1 << 19) /* AHB4 clock disable */
#define RCC_CFGR2_APB1DIS                (1 << 20) /* APB1 clock disable */
#define RCC_CFGR2_APB2DIS                (1 << 21) /* APB2 clock disable */
#define RCC_CFGR2_APB3DIS                (1 << 22) /* APB3 clock disable */

/* PLL1 configuration register */

