apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_rcc.h
#define RCC_PLL1DIVR_PLL1N_SHIFT            (0) /* Bits 8-0:  */
#define RCC_PLL1DIVR_PLL1N_MASK             (0x1ff << RCC_PLL1DIVR_PLL1N_SHIFT)
#  define RCC_PLL1DIVR_PLL1N(n)             ((n-1) << RCC_PLL1DIVR_PLL1N_SHIFT) /* m = 4..512 */

#define RCC_PLL1DIVR_PLL1P_SHIFT            (9) /* Bits 15-9:  */
#define RCC_PLL1DIVR_PLL1P_MASK             (0x7f << RCC_PLL1DIVR_PLL1P_SHIFT)
#  define RCC_PLL1DIVR_PLL1P(n)             ((n-1) << RCC_PLL1DIVR_PLL1P_SHIFT) /* m = 2..128 evens */

#define RCC_PLL1DIVR_PLL1Q_SHIFT            (16) /* Bits 22-16:  */
#define RCC_PLL1DIVR_PLL1Q_MASK             (0x7f << RCC_PLL1DIVR_PLL1Q_SHIFT)
#  define RCC_PLL1DIVR_PLL1Q(n)             ((n-1) << RCC_PLL1DIVR_PLL1Q_SHIFT) /* m = 1..128 */

#define RCC_PLL1DIVR_PLL1R_SHIFT            (24) /* Bits 30-24:  */
#define RCC_PLL1DIVR_PLL1R_MASK             (0x7f << RCC_PLL1DIVR_PLL1R_SHIFT)
#  define RCC_PLL1DIVR_PLL1R(n)             ((n-1) << RCC_PLL1DIVR_PLL1R_SHIFT) /* m = 1..128 */

/* PLL1 fractional divider register */

#define RCC_PLL1FRACR_PLL1FRACN_SHIFT       (3)
#define RCC_PLL1FRACR_PLL1FRACN_MASK        (0x1fff << RCC_PLL1FRACR_PLL1FRACN_SHIFT)
#define RCC_PLL1FRACR_PLL1FRACN(n)          (n << RCC_PLL1FRACR_PLL1FRACN_SHIFT) /* m = 0..8192 */

/* PLL2 dividers register */

#define RCC_PLL2DIVR_PLL2N_SHIFT            (0) /* Bits 8-0:  */
#define RCC_PLL2DIVR_PLL2N_MASK             (0x1ff << RCC_PLL2DIVR_PLL2N_SHIFT)
#  define RCC_PLL2DIVR_PLL2N(n)             ((n-1) << RCC_PLL2DIVR_PLL2N_SHIFT) /* m = 4..512 */

#define RCC_PLL2DIVR_PLL2P_SHIFT            (9) /* Bits 15-9:  */
#define RCC_PLL2DIVR_PLL2P_MASK             (0x7f << RCC_PLL2DIVR_PLL2P_SHIFT)
#  define RCC_PLL2DIVR_PLL2P(n)             ((n-1) << RCC_PLL2DIVR_PLL2P_SHIFT) /* m = 2..128 evens */

#define RCC_PLL2DIVR_PLL2Q_SHIFT            (16) /* Bits 22-16:  */
#define RCC_PLL2DIVR_PLL2Q_MASK             (0x7f << RCC_PLL2DIVR_PLL2Q_SHIFT)
#  define RCC_PLL2DIVR_PLL2Q(n)             ((n-1) << RCC_PLL2DIVR_PLL2Q_SHIFT) /* m = 1..128 */

#define RCC_PLL2DIVR_PLL2R_SHIFT            (24) /* Bits 30-24:  */
#define RCC_PLL2DIVR_PLL2R_MASK             (0x7f << RCC_PLL2DIVR_PLL2R_SHIFT)
#  define RCC_PLL2DIVR_PLL2R(n)             ((n-1) << RCC_PLL2DIVR_PLL2R_SHIFT) /* m = 1..128 */

/* PLL2 fractional divider register */

#define RCC_PLL2FRACR_PLL2FRACN_SHIFT       (3)
#define RCC_PLL2FRACR_PLL2FRACN_MASK        (0x1fff << RCC_PLL2FRACR_PLL2FRACN_SHIFT)
#define RCC_PLL2FRACR_PLL2FRACN(n)          (n << RCC_PLL2FRACR_PLL2FRACN_SHIFT) /* m = 0..8192 */

/* PLL3 dividers register */

#define RCC_PLL3DIVR_PLL3N_SHIFT            (0) /* Bits 8-0:  */
#define RCC_PLL3DIVR_PLL3N_MASK             (0x1ff << RCC_PLL3DIVR_PLL3N_SHIFT)
#  define RCC_PLL3DIVR_PLL3N(n)             ((n-1) << RCC_PLL3DIVR_PLL3N_SHIFT) /* m = 4..512 */

#define RCC_PLL3DIVR_PLL3P_SHIFT            (9) /* Bits 15-9:  */
#define RCC_PLL3DIVR_PLL3P_MASK             (0x7f << RCC_PLL3DIVR_PLL3P_SHIFT)
#  define RCC_PLL3DIVR_PLL3P(n)             ((n-1) << RCC_PLL3DIVR_PLL3P_SHIFT) /* m = 2..128 evens */

#define RCC_PLL3DIVR_PLL3Q_SHIFT            (16) /* Bits 22-16:  */
#define RCC_PLL3DIVR_PLL3Q_MASK             (0x7f << RCC_PLL3DIVR_PLL3Q_SHIFT)
#  define RCC_PLL3DIVR_PLL3Q(n)             ((n-1) << RCC_PLL3DIVR_PLL3Q_SHIFT) /* m = 1..128 */

#define RCC_PLL3DIVR_PLL3R_SHIFT            (24) /* Bits 30-24:  */
#define RCC_PLL3DIVR_PLL3R_MASK             (0x7f << RCC_PLL3DIVR_PLL3R_SHIFT)
#  define RCC_PLL3DIVR_PLL3R(n)             ((n-1) << RCC_PLL3DIVR_PLL3R_SHIFT) /* m = 1..128 */

/* PLL3 fractional divider register */

#define RCC_PLL3FRACR_PLL3FRACN_SHIFT       (3)
#define RCC_PLL3FRACR_PLL3FRACN_MASK        (0x1fff << RCC_PLL3FRACR_PLL3FRACN_SHIFT)
#define RCC_PLL3FRACR_PLL3FRACN(n)          (n << RCC_PLL3FRACR_PLL3FRACN_SHIFT) /* m = 0..8192 */

/* Clock interrupt enable register */

#define RCC_CIER_LSIRDYIE                (1 << 0)  /* Bit 0: LSI Ready Interrupt Enable */
#define RCC_CIER_LSERDYIE                (1 << 1)  /* Bit 1: LSE Ready Interrupt Enable */
#define RCC_CIER_CSIRDYIE                (1 << 2)  /* Bit 2: CSI Ready Interrupt Enable */
#define RCC_CIER_HSIRDYIE                (1 << 3)  /* Bit 3: HSI Ready Interrupt Enable */
#define RCC_CIER_HSERDYIE                (1 << 4)  /* Bit 4: HSE Ready Interrupt Enable */
#define RCC_CIER_HSI48RDYIE              (1 << 5)  /* Bit 5: HSI48 Ready Interrupt Enable */
#define RCC_CIER_PLL1RDYIE               (1 << 6)  /* Bit 6: PLL1 Ready Interrupt Enable */
#define RCC_CIER_PLL2RDYIE               (1 << 7)  /* Bit 7: PLL2 Ready Interrupt Enable */
#define RCC_CIER_PLL3RDYIE               (1 << 8)  /* Bit 8: PLL3 Ready Interrupt Enable */

/* Clock interrupt flag register */

#define RCC_CIFR_LSIRDYF                (1 << 0)  /* Bit 0: LSI Ready Interrupt Flag */
#define RCC_CIFR_LSERDYF                (1 << 1)  /* Bit 1: LSE Ready Interrupt Flag */
#define RCC_CIFR_CSIRDYF                (1 << 2)  /* Bit 2: CSI Ready Interrupt Flag */
#define RCC_CIFR_HSIRDYF                (1 << 3)  /* Bit 3: HSI Ready Interrupt Flag */
#define RCC_CIFR_HSERDYF                (1 << 4)  /* Bit 4: HSE Ready Interrupt Flag */
#define RCC_CIFR_HSI48RDYF              (1 << 5)  /* Bit 5: HSI48 Ready Interrupt Flag */
#define RCC_CIFR_PLL1RDYF               (1 << 6)  /* Bit 6: PLL1 Ready Interrupt Flag */
#define RCC_CIFR_PLL2RDYF               (1 << 7)  /* Bit 7: PLL2 Ready Interrupt Flag */
#define RCC_CIFR_PLL3RDYF               (1 << 8)  /* Bit 8: PLL3 Ready Interrupt Flag */
#define RCC_CIFR_HSECSSF                (1 << 10) /* Bit 10: HSE Clock Security System Interrupt Flag */

/* Clock interrupt clear register */

#define RCC_CICR_LSIRDYC                (1 << 0)  /* Bit 0: LSI Ready Interrupt Flag */
#define RCC_CICR_LSERDYC                (1 << 1)  /* Bit 1: LSE Ready Interrupt Flag */
#define RCC_CICR_CSIRDYC                (1 << 2)  /* Bit 2: CSI Ready Interrupt Flag */
#define RCC_CICR_HSIRDYC                (1 << 3)  /* Bit 3: HSI Ready Interrupt Flag */
#define RCC_CICR_HSERDYC                (1 << 4)  /* Bit 4: HSE Ready Interrupt Flag */
#define RCC_CICR_HSI48RDYC              (1 << 5)  /* Bit 5: HSI48 Ready Interrupt Flag */
#define RCC_CICR_PLL1RDYC               (1 << 6)  /* Bit 6: PLL1 Ready Interrupt Flag */
#define RCC_CICR_PLL2RDYC               (1 << 7)  /* Bit 7: PLL2 Ready Interrupt Flag */
#define RCC_CICR_PLL3RDYC               (1 << 8)  /* Bit 8: PLL3 Ready Interrupt Flag */
#define RCC_CICR_HSECSSC                (1 << 10) /* Bit 10: HSE Clock Security System Interrupt Flag */

/* AHB1 peripheral reset register */

#define RCC_AHB1RSTR_GPDMA1RST             (1 << 0)  /* Bit 0:  GPDMA1 reset */
#define RCC_AHB1RSTR_GPDMA2RST             (1 << 1)  /* Bit 1:  GPDMA2 reset */
#define RCC_AHB1RSTR_CRCRST                (1 << 12) /* Bit 12:  CRC reset */
#define RCC_AHB1RSTR_CORDICRST             (1 << 14) /* Bit 14:  CORDIC reset */
#define RCC_AHB1RSTR_FMACRST               (1 << 15) /* Bit 15:  FMAC reset */
#define RCC_AHB1RSTR_RAMCFGRST             (1 << 17) /* Bit 17:  RAMCFG reset */
#define RCC_AHB1RSTR_ETHRST                (1 << 19) /* Bit 19:  ETH reset */

/* AHB2 peripheral reset register */

#define RCC_AHB2RSTR_GPIORST(n)          (1 << (n))
#define RCC_AHB2RSTR_GPIOARST            (1 << 0)  /* Bit 0:  IO port A reset */
#define RCC_AHB2RSTR_GPIOBRST            (1 << 1)  /* Bit 1:  IO port B reset */
#define RCC_AHB2RSTR_GPIOCRST            (1 << 2)  /* Bit 2:  IO port C reset */
#define RCC_AHB2RSTR_GPIODRST            (1 << 3)  /* Bit 3:  IO port D reset */
#define RCC_AHB2RSTR_GPIOERST            (1 << 4)  /* Bit 4:  IO port E reset */
#define RCC_AHB2RSTR_GPIOFRST            (1 << 5)  /* Bit 5:  IO port F reset */
#define RCC_AHB2RSTR_GPIOGRST            (1 << 6)  /* Bit 6:  IO port G reset */
#define RCC_AHB2RSTR_GPIOHRST            (1 << 7)  /* Bit 7:  IO port H reset */
#define RCC_AHB2RSTR_GPIOIRST            (1 << 8)  /* Bit 8:  IO port I reset */
#define RCC_AHB2RSTR_ADCRST              (1 << 10) /* Bit 10: ADC interface reset (common to all ADCs) */
#define RCC_AHB2RSTR_DACRST              (1 << 11) /* Bit 11: DAC Block reset */
#define RCC_AHB2RSTR_DCMI_PSSIRST        (1 << 12) /* Bit 12: Digital Camera Interface block reset */
#define RCC_AHB2RSTR_AESRST              (1 << 16) /* Bit 16: AES Cryptographic module reset */
#define RCC_AHB2RSTR_HASHRST             (1 << 17) /* Bit 17: HASH block reset */
#define RCC_AHB2RSTR_RNGRST              (1 << 18) /* Bit 18: Random number generator module reset */
#define RCC_AHB2RSTR_PKARST              (1 << 19) /* Bit 19: Public Key Accelerator module reset */
#define RCC_AHB2RSTR_SAESRST             (1 << 20) /* Bit 20: SAES block reset */

/* AHB4 peripheral reset register */

#define RCC_AHB4RSTR_OTFDEC1RST          (1 << 7)  /* Bit 0:  OTFDEC1 block reset */
#define RCC_AHB4RSTR_SDMMC1RST           (1 << 11) /* Bit 11: SDMMC1RST blocks reset  */
#define RCC_AHB4RSTR_SDMMC2RST           (1 << 12) /* Bit 12: SDMMC2RST blocks reset  */
#define RCC_AHB4RSTR_FMCRST              (1 << 16) /* Bit 16: FMC block reset */
#define RCC_AHB4RSTR_OSPI1RST            (1 << 20) /* Bit 20: OCTOSPI1 block reset */

/* APB1 Peripheral reset register 1 */

