apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_rcc.h
#define RCC_APB1LRSTR_TIM2RST            (1 << 0)  /* Bit 0:  TIM2 reset */
#define RCC_APB1LRSTR_TIM3RST            (1 << 1)  /* Bit 1:  TIM3 reset */
#define RCC_APB1LRSTR_TIM4RST            (1 << 2)  /* Bit 2:  TIM4 reset */
#define RCC_APB1LRSTR_TIM5RST            (1 << 3)  /* Bit 3:  TIM5 reset */
#define RCC_APB1LRSTR_TIM6RST            (1 << 4)  /* Bit 4:  TIM6 reset */
#define RCC_APB1LRSTR_TIM7RST            (1 << 5)  /* Bit 5:  TIM7 reset */
#define RCC_APB1LRSTR_TIM12RST           (1 << 6)  /* Bit 5:  TIM12 reset */
#define RCC_APB1LRSTR_TIM13RST           (1 << 7)  /* Bit 5:  TIM13 reset */
#define RCC_APB1LRSTR_TIM14RST           (1 << 8)  /* Bit 5:  TIM14 reset */
#define RCC_APB1LRSTR_SPI2RST            (1 << 14) /* Bit 14: SPI2 reset */
#define RCC_APB1LRSTR_SPI3RST            (1 << 15) /* Bit 15: SPI3 reset */
#define RCC_APB1LRSTR_USART2RST          (1 << 17) /* Bit 17: USART2 reset */
#define RCC_APB1LRSTR_USART3RST          (1 << 18) /* Bit 18: USART3 reset */
#define RCC_APB1LRSTR_UART4RST           (1 << 19) /* Bit 19: UART4 reset */
#define RCC_APB1LRSTR_UART5RST           (1 << 20) /* Bit 20: UART5 reset */
#define RCC_APB1LRSTR_I2C1RST            (1 << 21) /* Bit 21: I2C1 reset */
#define RCC_APB1LRSTR_I2C2RST            (1 << 22) /* Bit 22: I2C2 reset */
#define RCC_APB1LRSTR_I3C1RST            (1 << 23) /* Bit 23: I3C1 reset */
#define RCC_APB1LRSTR_CRSRST             (1 << 24) /* Bit 24: CRS reset */
#define RCC_APB1LRSTR_USART6RST          (1 << 25) /* Bit 25: USART6 reset */
#define RCC_APB1LRSTR_USART10RST         (1 << 26) /* Bit 26: USART10 reset */
#define RCC_APB1LRSTR_USART11RST         (1 << 27) /* Bit 27: USART11 reset */
#define RCC_APB1LRSTR_CECRST             (1 << 28) /* Bit 28: CEC reset */
#define RCC_APB1LRSTR_UART7RST           (1 << 30) /* Bit 30: UART7 reset */
#define RCC_APB1LRSTR_UART8RST           (1 << 31) /* Bit 31: UART8 reset */

/* APB1 Peripheral reset register 2 */

#define RCC_APB1HRSTR_UART9RST           (1 << 0)  /* Bit 0:  UART9 reset */
#define RCC_APB1HRSTR_UART12RST          (1 << 1)  /* Bit 1:  UART12 reset */
#define RCC_APB1HRSTR_DTSRST             (1 << 3)  /* Bit 3:  DTS  reset */
#define RCC_APB1HRSTR_LPTIM2RST          (1 << 5)  /* Bit 5:  Low-power Timer 2 reset */
#define RCC_APB1HRSTR_FDCANRST           (1 << 9)  /* Bit 9:  FDCAN reset */
#define RCC_APB1HRSTR_UCPD1RST           (1 << 23) /* Bit 23: UCPD1 reset */

/* APB2 Peripheral reset register */

#define RCC_APB2RSTR_TIM1RST             (1 << 11) /* Bit 11: TIM1 reset */
#define RCC_APB2RSTR_SPI1RST             (1 << 12) /* Bit 12: SPI1 reset */
#define RCC_APB2RSTR_TIM8RST             (1 << 13) /* Bit 13: TIM8 reset */
#define RCC_APB2RSTR_USART1RST           (1 << 14) /* Bit 14: USART1 reset */
#define RCC_APB2RSTR_TIM15RST            (1 << 16) /* Bit 16: TIM15 reset */
#define RCC_APB2RSTR_TIM16RST            (1 << 17) /* Bit 17: TIM16 reset */
#define RCC_APB2RSTR_TIM17RST            (1 << 18) /* Bit 18: TIM17 reset */
#define RCC_APB2RSTR_SPI4RST             (1 << 19) /* Bit 19: SPI4 reset */
#define RCC_APB2RSTR_SPI67RST            (1 << 20) /* Bit 20: SPI6 reset */
#define RCC_APB2RSTR_SAI1RST             (1 << 21) /* Bit 21: SAI1 reset */
#define RCC_APB2RSTR_SAI2RST             (1 << 22) /* Bit 22: SAI2 reset */
#define RCC_APB2RSTR_USBRST              (1 << 24) /* Bit 24: USB reset */

/* APB3 Peripheral reset register */

#define RCC_APB3RSTR_SPI5RST             (1 << 5)  /* Bit 5: SPI5 reset */
#define RCC_APB3RSTR_LPUART1RST          (1 << 6)  /* Bit 6: LPUART1 reset */
#define RCC_APB3RSTR_I2C3RST             (1 << 7)  /* Bit 7: I2C3 reset */
#define RCC_APB3RSTR_I2C4RST             (1 << 8)  /* Bit 8: I2C4 reset */
#define RCC_APB3RSTR_I3C2RST             (1 << 9)  /* Bit 9: I3C2 reset */
#define RCC_APB3RSTR_LPTIM1RST           (1 << 11) /* Bit 11: LPTIM1 reset */
#define RCC_APB3RSTR_LPTIM3RST           (1 << 12) /* Bit 12: LPTIM3 reset */
#define RCC_APB3RSTR_LPTIM4RST           (1 << 13) /* Bit 13: LPTIM4 reset */
#define RCC_APB3RSTR_LPTIM5RST           (1 << 14) /* Bit 14: LPTIM5 reset */
#define RCC_APB3RSTR_LPTIM6RST           (1 << 15) /* Bit 15: LPTIM6 reset */
#define RCC_APB3RSTR_VREFRST             (1 << 20) /* Bit 20: VREF reset */

/* AHB1 Peripheral Clock enable register */

#define RCC_AHB1ENR_GPDMA1EN             (1 << 0)  /* Bit 0:  GPDMA1 clock enable */
#define RCC_AHB1ENR_GPDMA2EN             (1 << 1)  /* Bit 1:  GPDMA2 clock enable */
#define RCC_AHB1ENR_FLASHEN              (1 << 8)  /* Bit 8:  Flash Interface clock enable */
#define RCC_AHB1ENR_CRCEN                (1 << 12) /* Bit 12:  CRC clock enable */
#define RCC_AHB1ENR_CORDICEN             (1 << 14) /* Bit 14:  CORDIC clock enable */
#define RCC_AHB1ENR_FMACEN               (1 << 15) /* Bit 15:  FMAC clock enable */
#define RCC_AHB1ENR_RAMCFGEN             (1 << 17) /* Bit 17:  RAMCFG clock enable */
#define RCC_AHB1ENR_ETHEN                (1 << 19) /* Bit 19:  ETH clock enable */
#define RCC_AHB1ENR_ETHTXEN              (1 << 20) /* Bit 20:  ETH TX clock enable */
#define RCC_AHB1ENR_ETHRXEN              (1 << 21) /* Bit 21:  ETH RX clock enable */
#define RCC_AHB1ENR_TZSC1EN              (1 << 24) /* Bit 24:  TZSC1 clock enable */
#define RCC_AHB1ENR_BKPRAMEN             (1 << 28) /* Bit 28:  BKPRAM clock enable */
#define RCC_AHB1ENR_DCACHEEN             (1 << 30) /* Bit 25:  DCACHE clock enable */
#define RCC_AHB1ENR_SRAM1EN              (1 << 31) /* Bit 25:  SRAM1 clock enable */

/* AHB2 Peripheral Clock enable register */

#define RCC_AHB2ENR_GPIOEN(n)            (1 << (n))
#define RCC_AHB2ENR_GPIOAEN              (1 << 0)  /* Bit 0:  IO port A enable */
#define RCC_AHB2ENR_GPIOBEN              (1 << 1)  /* Bit 1:  IO port B enable */
#define RCC_AHB2ENR_GPIOCEN              (1 << 2)  /* Bit 2:  IO port C enable */
#define RCC_AHB2ENR_GPIODEN              (1 << 3)  /* Bit 3:  IO port D enable */
#define RCC_AHB2ENR_GPIOEEN              (1 << 4)  /* Bit 4:  IO port E enable */
#define RCC_AHB2ENR_GPIOFEN              (1 << 5)  /* Bit 5:  IO port F enable */
#define RCC_AHB2ENR_GPIOGEN              (1 << 6)  /* Bit 6:  IO port G enable */
#define RCC_AHB2ENR_GPIOHEN              (1 << 7)  /* Bit 7:  IO port H enable */
#define RCC_AHB2ENR_GPIOIEN              (1 << 8)  /* Bit 8:  IO port I enable */
#define RCC_AHB2ENR_ADCEN                (1 << 10) /* Bit 10: ADC interface enable (common to all ADCs) */
#define RCC_AHB2ENR_DAC1EN               (1 << 11) /* Bit 11: DAC clock enable */
#define RCC_AHB2ENR_DCMI_PSSIEN          (1 << 12) /* Bit 12: Digital Camera Interface Clock Enable */
#define RCC_AHB2ENR_AESEN                (1 << 16) /* Bit 16: AES Cryptographic module enable */
#define RCC_AHB2ENR_HASHEN               (1 << 17) /* Bit 17: HASH module enable */
#define RCC_AHB2ENR_RNGEN                (1 << 18) /* Bit 18: Random number generator module enable */
#define RCC_AHB2ENR_PKAEN                (1 << 19) /* Bit 19: PKA clock enable */
#define RCC_AHB2ENR_SAESEN               (1 << 20) /* Bit 20: SAES clock enable */
#define RCC_AHB2ENR_SRAM2EN              (1 << 30) /* Bit 30: SRAM2 clock enable */
#define RCC_AHB2ENR_SRAM3EN              (1 << 31) /* Bit 30: SRAM2 clock enable */

/* AHB4 Peripheral Clock enable register */

#define RCC_AHB4ENR_OTFDEC1EN            (1 << 7)   /* Bit  7: On-the-fly decryption module clock enable */
#define RCC_AHB4ENR_SDMMC1EN             (1 << 11)  /* Bit 11: SDMMC1 clock enable */
#define RCC_AHB4ENR_SDMMC2EN             (1 << 12)  /* Bit 12: SDMMC2 clock enable */
#define RCC_AHB4ENR_FMCEN                (1 << 16)  /* Bit 16: Flexible memory controller module enable */
#define RCC_AHB4ENR_OSPI1EN              (1 << 20)  /* Bit 20: OCTOSPI1 module enable */

/* APB1 Peripheral clock enable register 1 */

#define RCC_APB1LENR_TIM2EN            (1 << 0)  /* Bit 0:  TIM2 clock enable */
#define RCC_APB1LENR_TIM3EN            (1 << 1)  /* Bit 1:  TIM3 clock enable */
#define RCC_APB1LENR_TIM4EN            (1 << 2)  /* Bit 2:  TIM4 clock enable */
#define RCC_APB1LENR_TIM5EN            (1 << 3)  /* Bit 3:  TIM5 clock enable */
#define RCC_APB1LENR_TIM6EN            (1 << 4)  /* Bit 4:  TIM6 clock enable */
#define RCC_APB1LENR_TIM7EN            (1 << 5)  /* Bit 5:  TIM7 clock enable */
#define RCC_APB1LENR_TIM12EN           (1 << 6)  /* Bit 6:  TIM12 clock enable */
#define RCC_APB1LENR_TIM13EN           (1 << 7)  /* Bit 7:  TIM13 clock enable */
#define RCC_APB1LENR_TIM14EN           (1 << 8)  /* Bit 8:  TIM14 clock enable */
#define RCC_APB1LENR_WWDGEN            (1 << 11) /* Bit 11: WWDG clock enable */
#define RCC_APB1LENR_SPI2EN            (1 << 14) /* Bit 14: SPI2 clock enable */
#define RCC_APB1LENR_SPI3EN            (1 << 15) /* Bit 15: SPI3 clock enable */
#define RCC_APB1LENR_USART2EN          (1 << 17) /* Bit 17: USART2 clock enable */
#define RCC_APB1LENR_USART3EN          (1 << 18) /* Bit 18: USART3 clock enable */
#define RCC_APB1LENR_UART4EN           (1 << 19) /* Bit 19: UART4 clock enable */
#define RCC_APB1LENR_UART5EN           (1 << 20) /* Bit 20: UART5 clock enable */
#define RCC_APB1LENR_I2C1EN            (1 << 21) /* Bit 21: I2C1 clock enable */
#define RCC_APB1LENR_I2C2EN            (1 << 22) /* Bit 22: I2C2 clock enable */
#define RCC_APB1LENR_I3C1EN            (1 << 23) /* Bit 23: I3C1 clock enable */
#define RCC_APB1LENR_CRSEN             (1 << 24) /* Bit 24: CRS clock enable */
#define RCC_APB1LENR_USART6EN          (1 << 25) /* Bit 25: USART6 clock enable */
#define RCC_APB1LENR_USART10EN         (1 << 26) /* Bit 26: USART10 clock enable */
#define RCC_APB1LENR_USART11EN         (1 << 27) /* Bit 27: USART11 clock enable */
#define RCC_APB1LENR_CECEN             (1 << 28) /* Bit 28: CEC clock enable */
#define RCC_APB1LENR_UART7EN           (1 << 30) /* Bit 30: UART7 clock enable */
#define RCC_APB1LENR_UART8EN           (1 << 31) /* Bit 31: UART8 clock enable */

/* APB1 Peripheral clock enable register 2 */

#define RCC_APB1HENR_UART9EN           (1 << 0)  /* Bit 0:  UART9 clock enable */
#define RCC_APB1HENR_UART12EN          (1 << 1)  /* Bit 1:  UART12 clock enable */
#define RCC_APB1HENR_DTSEN             (1 << 3)  /* Bit 3:  DTS  clock enable */
#define RCC_APB1HENR_LPTIM2EN          (1 << 5)  /* Bit 5:  Low-power Timer 2 clock enable */
#define RCC_APB1HENR_FDCANEN           (1 << 9)  /* Bit 9:  FDCAN clock enable */
#define RCC_APB1HENR_UCPD1EN           (1 << 23) /* Bit 23: UCPD1 clock enable */

