apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_rcc.h
/* APB2 Peripheral clock enable register */

#define RCC_APB2LPENR_TIM1LPEN             (1 << 11) /* Bit 11: TIM1 clock enable during sleep mode */
#define RCC_APB2LPENR_SPI1LPEN             (1 << 12) /* Bit 12: SPI1 clock enable during sleep mode */
#define RCC_APB2LPENR_TIM8LPEN             (1 << 13) /* Bit 13: TIM8 clock enable during sleep mode */
#define RCC_APB2LPENR_USART1LPEN           (1 << 14) /* Bit 14: USART1 clock enable during sleep mode */
#define RCC_APB2LPENR_TIM15LPEN            (1 << 16) /* Bit 16: TIM15 clock enable during sleep mode */
#define RCC_APB2LPENR_TIM16LPEN            (1 << 17) /* Bit 17: TIM16 clock enable during sleep mode */
#define RCC_APB2LPENR_TIM17LPEN            (1 << 18) /* Bit 18: TIM17 clock enable during sleep mode */
#define RCC_APB2LPENR_SPI4LPEN             (1 << 19) /* Bit 19: SPI4 clock enable during sleep mode */
#define RCC_APB2LPENR_SPI67LPEN            (1 << 20) /* Bit 20: SPI6 clock enable during sleep mode */
#define RCC_APB2LPENR_SAI1LPEN             (1 << 21) /* Bit 21: SAI1 clock enable during sleep mode */
#define RCC_APB2LPENR_SAI2LPEN             (1 << 22) /* Bit 22: SAI2 clock enable during sleep mode */
#define RCC_APB2LPENR_USBLPEN              (1 << 24) /* Bit 24: USB clock enable during sleep mode */

/* APB3 Peripheral clock enable register */

#define RCC_APB3LPENR_SBSLPEN              (1 << 1)  /* Bit 1: SBS clock enable during sleep mode */
#define RCC_APB3LPENR_SPI5LPEN             (1 << 5)  /* Bit 5: SPI5 clock enable during sleep mode */
#define RCC_APB3LPENR_LPUART1LPEN          (1 << 6)  /* Bit 6: LPUART1 clock enable during sleep mode */
#define RCC_APB3LPENR_I2C3LPEN             (1 << 7)  /* Bit 7: I2C3 clock enable during sleep mode */
#define RCC_APB3LPENR_I2C4LPEN             (1 << 8)  /* Bit 8: I2C4 clock enable during sleep mode */
#define RCC_APB3LPENR_I3C2LPEN             (1 << 9)  /* Bit 9: I3C2 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM1LPEN           (1 << 11) /* Bit 11: LPTIM1 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM3LPEN           (1 << 12) /* Bit 12: LPTIM3 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM4LPEN           (1 << 13) /* Bit 13: LPTIM4 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM5LPEN           (1 << 14) /* Bit 14: LPTIM5 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM6LPEN           (1 << 15) /* Bit 15: LPTIM6 clock enable during sleep mode */
#define RCC_APB3LPENR_VREFLPEN             (1 << 20) /* Bit 20: VREF clock enable during sleep mode */
#define RCC_APB3LPENR_RTCAPBLPEN           (1 << 21) /* Bit 21: RTCABP clock enable during sleep mode */

/* Kernel Clock Configuration register 1 */

#define RCC_CCIPR1_USART1SEL_SHIFT        (0)
#define RCC_CCIPR1_USART1SEL_MASK         (7 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_RCCPCLK2   (0 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_PLL2QCK    (1 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_PLL3QCK    (2 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_HSIKERCK   (3 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_CSIKERCK   (4 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_LSECK      (5 << RCC_CCIPR1_USART1SEL_SHIFT)

#define RCC_CCIPR1_USART2SEL_SHIFT        (3)
#define RCC_CCIPR1_USART2SEL_MASK         (7 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_RCCPCLK1   (0 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_PLL2QCK    (1 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_PLL3QCK    (2 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_HSIKERCK   (3 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_CSIKERCK   (4 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_LSECK      (5 << RCC_CCIPR1_USART2SEL_SHIFT)

#define RCC_CCIPR1_USART3SEL_SHIFT        (6)
#define RCC_CCIPR1_USART3SEL_MASK         (7 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_RCCPCLK1   (0 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_PLL2QCK    (1 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_PLL3QCK    (2 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_HSIKERCK   (3 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_CSIKERCK   (4 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_LSECK      (5 << RCC_CCIPR1_USART3SEL_SHIFT)

#define RCC_CCIPR1_UART4SEL_SHIFT        (9)
#define RCC_CCIPR1_UART4SEL_MASK         (7 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_PLL2QCK    (1 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_PLL3QCK    (2 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_HSIKERCK   (3 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_CSIKERCK   (4 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_LSECK      (5 << RCC_CCIPR1_UART4SEL_SHIFT)

#define RCC_CCIPR1_UART5SEL_SHIFT        (12)
#define RCC_CCIPR1_UART5SEL_MASK         (7 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_PLL2QCK    (1 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_PLL3QCK    (2 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_HSIKERCK   (3 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_CSIKERCK   (4 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_LSECK      (5 << RCC_CCIPR1_UART5SEL_SHIFT)

#define RCC_CCIPR1_USART6SEL_SHIFT       (15)
#define RCC_CCIPR1_USART6SEL_MASK        (7 << RCC_CCIPR1_USART6SEL_SHIFT)
#  define RCC_CCIPR1_USART6SEL_RCCPCLK1  (0 << RCC_CCIPR1_USART6SEL_SHIFT)
#  define RCC_CCIPR1_USART6SEL_PLL2QCK   (1 << RCC_CCIPR1_USART6SEL_SHIFT)
#  define RCC_CCIPR1_USART6SEL_PLL3QCK   (2 << RCC_CCIPR1_USART6SEL_SHIFT)
#  define RCC_CCIPR1_USART6SEL_HSIKERCK  (3 << RCC_CCIPR1_USART6SEL_SHIFT)
#  define RCC_CCIPR1_USART6SEL_CSIKERCK  (4 << RCC_CCIPR1_USART6SEL_SHIFT)
#  define RCC_CCIPR1_USART6SEL_LSECK     (5 << RCC_CCIPR1_USART6SEL_SHIFT)

#define RCC_CCIPR1_UART7SEL_SHIFT        (18)
#define RCC_CCIPR1_UART7SEL_MASK         (7 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_PLL2QCK    (1 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_PLL3QCK    (2 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_HSIKERCK   (3 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_CSIKERCK   (4 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_LSECK      (5 << RCC_CCIPR1_UART7SEL_SHIFT)

#define RCC_CCIPR1_UART8SEL_SHIFT        (21)
#define RCC_CCIPR1_UART8SEL_MASK         (7 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_PLL2QCK    (1 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_PLL3QCK    (2 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_HSIKERCK   (3 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_CSIKERCK   (4 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_LSECK      (5 << RCC_CCIPR1_UART8SEL_SHIFT)

