apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_rcc.h
#define RCC_CCIPR1_UART9SEL_SHIFT        (24)
#define RCC_CCIPR1_UART9SEL_MASK         (7 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_PLL2QCK    (1 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_PLL3QCK    (2 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_HSIKERCK   (3 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_CSIKERCK   (4 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_LSECK      (5 << RCC_CCIPR1_UART9SEL_SHIFT)

#define RCC_CCIPR1_USART10SEL_SHIFT       (27)
#define RCC_CCIPR1_USART10SEL_MASK        (7 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_RCCPCLK1  (0 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_PLL2QCK   (1 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_PLL3QCK   (2 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_HSIKERCK  (3 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_CSIKERCK  (4 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_LSECK     (5 << RCC_CCIPR1_USART10SEL_SHIFT)

#define RCC_CCIPR1_TIMICSEL               (1 << 31)

/* Kernel Clock Configuration register 2 */

#define RCC_CCIPR2_USART11SEL_SHIFT        (0)
#define RCC_CCIPR2_USART11SEL_MASK         (7 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_RCCPCLK1   (0 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_PLL2QCK    (1 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_PLL3QCK    (2 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_HSIKERCK   (3 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_CSIKERCK   (4 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_LSECK      (5 << RCC_CCIPR2_USART11SEL_SHIFT)

#define RCC_CCIPR2_UART12SEL_SHIFT         (4)
#define RCC_CCIPR2_UART12SEL_MASK          (7 << RCC_CCIPR2_UART12SEL_SHIFT)
#  define RCC_CCIPR2_UART12SEL_RCCPCLK1    (0 << RCC_CCIPR2_UART12SEL_SHIFT)
#  define RCC_CCIPR2_UART12SEL_PLL2QCK     (1 << RCC_CCIPR2_UART12SEL_SHIFT)
#  define RCC_CCIPR2_UART12SEL_PLL3QCK     (2 << RCC_CCIPR2_UART12SEL_SHIFT)
#  define RCC_CCIPR2_UART12SEL_HSIKERCK    (3 << RCC_CCIPR2_UART12SEL_SHIFT)
#  define RCC_CCIPR2_UART12SEL_CSIKERCK    (4 << RCC_CCIPR2_UART12SEL_SHIFT)
#  define RCC_CCIPR2_UART12SEL_LSECK       (5 << RCC_CCIPR2_UART12SEL_SHIFT)

#define RCC_CCIPR2_LPTIM1SEL_SHIFT         (8)
#define RCC_CCIPR2_LPTIM1SEL_MASK          (7 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_LSEKERCK    (3 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_LSIKERCK    (4 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_PERCK       (5 << RCC_CCIPR2_LPTIM1SEL_SHIFT)

#define RCC_CCIPR2_LPTIM2SEL_SHIFT         (12)
#define RCC_CCIPR2_LPTIM2SEL_MASK          (7 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_RCCPCLK1    (0 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_LSEKERCK    (3 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_LSIKERCK    (4 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_PERCK       (5 << RCC_CCIPR2_LPTIM2SEL_SHIFT)

#define RCC_CCIPR2_LPTIM3SEL_SHIFT         (16)
#define RCC_CCIPR2_LPTIM3SEL_MASK          (7 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_LSEKERCK    (3 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_LSIKERCK    (4 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_PERCK       (5 << RCC_CCIPR2_LPTIM3SEL_SHIFT)

#define RCC_CCIPR2_LPTIM4SEL_SHIFT         (20)
#define RCC_CCIPR2_LPTIM4SEL_MASK          (7 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_LSEKERCK    (3 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_LSIKERCK    (4 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_PERCK       (5 << RCC_CCIPR2_LPTIM4SEL_SHIFT)

#define RCC_CCIPR2_LPTIM5SEL_SHIFT         (24)
#define RCC_CCIPR2_LPTIM5SEL_MASK          (7 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_LSEKERCK    (3 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_LSIKERCK    (4 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_PERCK       (5 << RCC_CCIPR2_LPTIM5SEL_SHIFT)

#define RCC_CCIPR2_LPTIM6SEL_SHIFT         (28)
#define RCC_CCIPR2_LPTIM6SEL_MASK          (7 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_LSEKERCK    (3 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_LSIKERCK    (4 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_PERCK       (5 << RCC_CCIPR2_LPTIM6SEL_SHIFT)

/* Kernel Clock Configuration register 3 */

