apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_rcc.h
#define RCC_CCIPR3_SPI1SEL_SHIFT         (0)
#define RCC_CCIPR3_SPI1SEL_MASK          (7 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_PLL1QCK     (0 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_PLL2PCK     (1 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_PLL3PCK     (2 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_AUDIOCK     (3 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_PERCK       (4 << RCC_CCIPR3_SPI1SEL_SHIFT)

#define RCC_CCIPR3_SPI2SEL_SHIFT         (3)
#define RCC_CCIPR3_SPI2SEL_MASK          (7 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_PLL1QCK     (0 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_PLL2PCK     (1 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_PLL3PCK     (2 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_AUDIOCK     (3 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_PERCK       (4 << RCC_CCIPR3_SPI2SEL_SHIFT)

#define RCC_CCIPR3_SPI3SEL_SHIFT         (6)
#define RCC_CCIPR3_SPI3SEL_MASK          (7 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_PLL1QCK     (0 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_PLL2PCK     (1 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_PLL3PCK     (2 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_AUDIOCK     (3 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_PERCK       (4 << RCC_CCIPR3_SPI3SEL_SHIFT)

#define RCC_CCIPR3_SPI4SEL_SHIFT         (9)
#define RCC_CCIPR3_SPI4SEL_MASK          (7 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_RCCPCLK2    (0 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_PLL2QCK     (1 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_PLL3QCK     (2 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_HSIKERCK    (3 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_CSIKERCK    (4 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_HSECK       (5 << RCC_CCIPR3_SPI4SEL_SHIFT)

#define RCC_CCIPR3_SPI5SEL_SHIFT         (12)
#define RCC_CCIPR3_SPI5SEL_MASK          (7 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_RCCPCLK3    (0 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_PLL2QCK     (1 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_PLL3QCK     (2 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_HSIKERCK    (3 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_CSIKERCK    (4 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_HSECK       (5 << RCC_CCIPR3_SPI5SEL_SHIFT)

#define RCC_CCIPR3_SPI6SEL_SHIFT         (15)
#define RCC_CCIPR3_SPI6SEL_MASK          (7 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_RCCPCLK2    (0 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_PLL2QCK     (1 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_PLL3QCK     (2 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_HSIKERCK    (3 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_CSIKERCK    (4 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_HSECK       (5 << RCC_CCIPR3_SPI6SEL_SHIFT)

#define RCC_CCIPR3_LPUART1SEL_SHIFT         (24)
#define RCC_CCIPR3_LPUART1SEL_MASK          (7 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_RCCPCLK3    (0 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_PLL2QCK     (1 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_PLL3QCK     (2 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_HSIKERCK    (3 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_CSIKERCK    (4 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_LSECK       (5 << RCC_CCIPR3_LPUART1SEL_SHIFT)

/* Kernel Clock Configuration register 4 */

#define RCC_CCIPR4_OCTOSPI1SEL_SHIFT        (0)
#define RCC_CCIPR4_OCTOSPI1SEL_MASK         (3 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)
#  define RCC_CCIPR4_OCTOSPI1SEL_RCCHCLK4   (0 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)
#  define RCC_CCIPR4_OCTOSPI1SEL_PLL1QCK    (1 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)
#  define RCC_CCIPR4_OCTOSPI1SEL_PLL2RCK    (2 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)
#  define RCC_CCIPR4_OCTOSPI1SEL_PERCK   (3 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)

#define RCC_CCIPR4_SYSTICKSEL_SHIFT        (2)
#define RCC_CCIPR4_SYSTICKSEL_MASK         (3 << RCC_CCIPR4_SYSTICKSEL_SHIFT)
#  define RCC_CCIPR4_SYSTICKSEL_RCCHCLKd8  (0 << RCC_CCIPR4_SYSTICKSEL_SHIFT)
#  define RCC_CCIPR4_SYSTICKSEL_LSIKERCK1  (1 << RCC_CCIPR4_SYSTICKSEL_SHIFT)
#  define RCC_CCIPR4_SYSTICKSEL_LSICK1     (2 << RCC_CCIPR4_SYSTICKSEL_SHIFT)

#define RCC_CCIPR4_USBSEL_SHIFT        (4)
#define RCC_CCIPR4_USBSEL_MASK         (3 << RCC_CCIPR4_USBSEL_SHIFT)
#  define RCC_CCIPR4_USBSEL_NOCK       (0 << RCC_CCIPR4_USBSEL_SHIFT)
#  define RCC_CCIPR4_USBSEL_PLL1QCK    (1 << RCC_CCIPR4_USBSEL_SHIFT)
#  define RCC_CCIPR4_USBSEL_PLL3QCK    (2 << RCC_CCIPR4_USBSEL_SHIFT)
#  define RCC_CCIPR4_USBSEL_HSI48KERCK (3 << RCC_CCIPR4_USBSEL_SHIFT)

#define RCC_CCIPR4_SDMMC1SEL           (1 << 6)
#define RCC_CCIPR4_SDMMC2SEL           (1 << 7)

#define RCC_CCIPR4_I2C1SEL_SHIFT        (16)
#define RCC_CCIPR4_I2C1SEL_MASK         (3 << RCC_CCIPR4_I2C1SEL_SHIFT)
#  define RCC_CCIPR4_I2C1SEL_RCCPCLK1   (0 << RCC_CCIPR4_I2C1SEL_SHIFT)
#  define RCC_CCIPR4_I2C1SEL_PLL3RCK    (1 << RCC_CCIPR4_I2C1SEL_SHIFT)
#  define RCC_CCIPR4_I2C1SEL_HSIKERCK   (2 << RCC_CCIPR4_I2C1SEL_SHIFT)
#  define RCC_CCIPR4_I2C1SEL_CSIKERCK   (3 << RCC_CCIPR4_I2C1SEL_SHIFT)

#define RCC_CCIPR4_I2C2SEL_SHIFT        (18)
#define RCC_CCIPR4_I2C2SEL_MASK         (3 << RCC_CCIPR4_I2C2SEL_SHIFT)
#  define RCC_CCIPR4_I2C2SEL_RCCPCLK1   (0 << RCC_CCIPR4_I2C2SEL_SHIFT)
#  define RCC_CCIPR4_I2C2SEL_PLL3RCK    (1 << RCC_CCIPR4_I2C2SEL_SHIFT)
#  define RCC_CCIPR4_I2C2SEL_HSIKERCK   (2 << RCC_CCIPR4_I2C2SEL_SHIFT)
#  define RCC_CCIPR4_I2C2SEL_CSIKERCK   (3 << RCC_CCIPR4_I2C2SEL_SHIFT)

#define RCC_CCIPR4_I2C3SEL_SHIFT        (20)
#define RCC_CCIPR4_I2C3SEL_MASK         (3 << RCC_CCIPR4_I2C3SEL_SHIFT)
#  define RCC_CCIPR4_I2C3SEL_RCCPCLK3   (0 << RCC_CCIPR4_I2C3SEL_SHIFT)
#  define RCC_CCIPR4_I2C3SEL_PLL3RCK    (1 << RCC_CCIPR4_I2C3SEL_SHIFT)
#  define RCC_CCIPR4_I2C3SEL_HSIKERCK   (2 << RCC_CCIPR4_I2C3SEL_SHIFT)
#  define RCC_CCIPR4_I2C3SEL_CSIKERCK   (3 << RCC_CCIPR4_I2C3SEL_SHIFT)

#define RCC_CCIPR4_I2C4SEL_SHIFT        (22)
#define RCC_CCIPR4_I2C4SEL_MASK         (3 << RCC_CCIPR4_I2C4SEL_SHIFT)
#  define RCC_CCIPR4_I2C4SEL_RCCPCLK3   (0 << RCC_CCIPR4_I2C4SEL_SHIFT)
#  define RCC_CCIPR4_I2C4SEL_PLL3RCK    (1 << RCC_CCIPR4_I2C4SEL_SHIFT)
#  define RCC_CCIPR4_I2C4SEL_HSIKERCK   (2 << RCC_CCIPR4_I2C4SEL_SHIFT)
#  define RCC_CCIPR4_I2C4SEL_CSIKERCK   (3 << RCC_CCIPR4_I2C4SEL_SHIFT)

#define RCC_CCIPR4_I3C1SEL_SHIFT        (24)
#define RCC_CCIPR4_I3C1SEL_MASK         (3 << RCC_CCIPR4_I3C1SEL_SHIFT)
#  define RCC_CCIPR4_I3C1SEL_RCCPCLK1   (0 << RCC_CCIPR4_I3C1SEL_SHIFT)
#  define RCC_CCIPR4_I3C1SEL_PLL3RCK    (1 << RCC_CCIPR4_I3C1SEL_SHIFT)
#  define RCC_CCIPR4_I3C1SEL_HSIKERCK   (2 << RCC_CCIPR4_I3C1SEL_SHIFT)
#  define RCC_CCIPR4_I3C1SEL_NOCK       (3 << RCC_CCIPR4_I3C1SEL_SHIFT)

#define RCC_CCIPR4_I3C2SEL_SHIFT        (24)
#define RCC_CCIPR4_I3C2SEL_MASK         (3 << RCC_CCIPR4_I3C2SEL_SHIFT)
#  define RCC_CCIPR4_I3C2SEL_RCCPCLK1   (0 << RCC_CCIPR4_I3C2SEL_SHIFT)
#  define RCC_CCIPR4_I3C2SEL_PLL3RCK    (1 << RCC_CCIPR4_I3C2SEL_SHIFT)
#  define RCC_CCIPR4_I3C2SEL_HSIKERCK   (2 << RCC_CCIPR4_I3C2SEL_SHIFT)
#  define RCC_CCIPR4_I3C2SEL_NOCK       (3 << RCC_CCIPR4_I3C2SEL_SHIFT)

/* Kernel Clock Configuration register 5 */

