apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_rcc.h
#define RCC_CCIPR5_ADCDACSEL_SHIFT        (0)
#define RCC_CCIPR5_ADCDACSEL_MASK         (7 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_RCCHCLK    (0 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_SYSCK      (1 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_PLL2RCK    (2 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_HSECK      (3 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_HSEKERCK   (4 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_CSIKERCK   (5 << RCC_CCIPR5_ADCDACSEL_SHIFT)

#define RCC_CCIPR5_DACSEL                 (1 << 3)

#define RCC_CCIPR5_RNGSEL_SHIFT        (4)
#define RCC_CCIPR5_RNGSEL_MASK         (3 << RCC_CCIPR5_RNGSEL_SHIFT)
#  define RCC_CCIPR5_RNGSEL_HSI48KERCK (0 << RCC_CCIPR5_RNGSEL_SHIFT)
#  define RCC_CCIPR5_RNGSEL_PLL1QCK    (1 << RCC_CCIPR5_RNGSEL_SHIFT)
#  define RCC_CCIPR5_RNGSEL_LSECK      (2 << RCC_CCIPR5_RNGSEL_SHIFT)
#  define RCC_CCIPR5_RNGSEL_LSIKERCK   (3 << RCC_CCIPR5_RNGSEL_SHIFT)

#define RCC_CCIPR5_CECSEL_SHIFT          (6)
#define RCC_CCIPR5_CECSEL_MASK           (3 << RCC_CCIPR5_CECSEL_SHIFT)
#  define RCC_CCIPR5_CECSEL_LSECK        (0 << RCC_CCIPR5_CECSEL_SHIFT)
#  define RCC_CCIPR5_CECSEL_LSIKERCK     (1 << RCC_CCIPR5_CECSEL_SHIFT)
#  define RCC_CCIPR5_CECSEL_CSIKERCKd122 (2 << RCC_CCIPR5_CECSEL_SHIFT)

#define RCC_CCIPR5_FDCANSEL_SHIFT      (8)
#define RCC_CCIPR5_FDCANSEL_MASK       (3 << RCC_CCIPR5_FDCANSEL_SHIFT)
#  define RCC_CCIPR5_FDCANSEL_HSECK    (0 << RCC_CCIPR5_FDCANSEL_SHIFT)
#  define RCC_CCIPR5_FDCANSEL_PLL1QCK  (1 << RCC_CCIPR5_FDCANSEL_SHIFT)
#  define RCC_CCIPR5_FDCANSEL_PLL2QCK  (2 << RCC_CCIPR5_FDCANSEL_SHIFT)

#define RCC_CCIPR5_SAI1SEL_SHIFT        (16)
#define RCC_CCIPR5_SAI1SEL_MASK         (7 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_PLL1QCK    (0 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_PLL2PCK    (1 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_PLL3PCK    (2 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_AUDIOCLK   (3 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_PERCK      (4 << RCC_CCIPR5_SAI1SEL_SHIFT)

#define RCC_CCIPR5_SAI2SEL_SHIFT        (19)
#define RCC_CCIPR5_SAI2SEL_MASK         (7 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_PLL1QCK    (0 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_PLL2PCK    (1 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_PLL3PCK    (2 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_AUDIOCLK   (3 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_PERCK      (4 << RCC_CCIPR5_SAI2SEL_SHIFT)

#define RCC_CCIPR5_CKPERSEL_SHIFT       (30)
#define RCC_CCIPR5_CKPERSEL_MASK        (3 << RCC_CCIPR5_CKPERSEL_SHIFT)
#  define RCC_CCIPR5_CKPERSEL_HSIKERCK  (0 << RCC_CCIPR5_CKPERSEL_SHIFT)
#  define RCC_CCIPR5_CKPERSEL_CSIKERCK  (1 << RCC_CCIPR5_CKPERSEL_SHIFT)
#  define RCC_CCIPR5_CKPERSEL_HSECK     (2 << RCC_CCIPR5_CKPERSEL_SHIFT)

/* Backup domain control register */

#define RCC_BDCR_LSEON                   (1 << 0)  /* Bit 0: External Low Speed oscillator enable */
#define RCC_BDCR_LSERDY                  (1 << 1)  /* Bit 1: External Low Speed oscillator Ready */
#define RCC_BDCR_LSEBYP                  (1 << 2)  /* Bit 2: External Low Speed oscillator Bypass */

#define RCC_BDCR_LSEDRV_SHIFT            (3)       /* Bits 3-4: LSE oscillator drive capability */
#define RCC_BDCR_LSEDRV_MASK             (3 << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_LOW            (0 << RCC_BDCR_LSEDRV_SHIFT) /* 00: Lower driving capability */
#  define RCC_BDCR_LSEDRV_MEDLO          (1 << RCC_BDCR_LSEDRV_SHIFT) /* 01: Medium Low driving capability */
#  define RCC_BDCR_LSEDRV_MEDHI          (2 << RCC_BDCR_LSEDRV_SHIFT) /* 10: Medium High driving capability*/
#  define RCC_BDCR_LSEDRV_HIGH           (3 << RCC_BDCR_LSEDRV_SHIFT) /* 11: Higher driving capability */

#define RCC_BDCR_LSECSSON                (1 << 5) /* Bit 5: CSS on LSE enable */
#define RCC_BDCR_LSECSSD                 (1 << 6) /* Bit 6: CSS on LSE failure Detection */
#define RCC_BDCR_LSEEXT                  (1 << 7) /* Bit 7: LSE external clock type in bypass mode */

#define RCC_BDCR_RTCSEL_SHIFT            (8)       /* Bits 9:8: RTC clock source selection */
#define RCC_BDCR_RTCSEL_MASK             (3 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_NOCLK          (0 << RCC_BDCR_RTCSEL_SHIFT) /* 00: No clock */
#  define RCC_BDCR_RTCSEL_LSE            (1 << RCC_BDCR_RTCSEL_SHIFT) /* 01: LSE oscillator clock used as RTC clock */
#  define RCC_BDCR_RTCSEL_LSI            (2 << RCC_BDCR_RTCSEL_SHIFT) /* 10: LSI oscillator clock used as RTC clock */
#  define RCC_BDCR_RTCSEL_HSE            (3 << RCC_BDCR_RTCSEL_SHIFT) /* 11: HSE oscillator clock divided by 32 used as RTC clock */

#define RCC_BDCR_RTCEN                   (1 << 15)         /* Bit 15: RTC clock enable */
#define RCC_BDCR_VSWRST                  (1 << 16)         /* Bit 16: VSwitch domain software reset */
#define RCC_BDCR_LSCOEN                  (1 << 24)         /* Bit 24: Low speed clock output enable */
#define RCC_BDCR_LSCOSEL                 (1 << 25)         /* Bit 25: Low speed clock output selection */
#  define RCC_BCDR_LSCOSEL_LSI           0                 /* LSI selected */
#  define RCC_BDCR_LSCOSEL_LSE           RCC_BDCR_LSCOSEL  /* LSE selected */

#define RCC_BDCR_LSION                   (1 << 26)         /* Bit 26: LSI Oscillator Enable */
#define RCC_BDCR_LSIRDY                  (1 << 27)         /* Bit 27: LSI Oscillator Ready */

/* Reset status register */

#define RCC_RSR_RMVF                     (1 << 23) /* Bit 23: Remove reset flag */
#define RCC_RSR_PINRSTF                  (1 << 26) /* Bit 26: PIN reset flag */
#define RCC_RSR_BORRSTF                  (1 << 27) /* Bit 27: BOR reset flag */
#define RCC_RSR_SFTRSTF                  (1 << 28) /* Bit 28: Software Reset flag */
#define RCC_RSR_IWDGRSTF                 (1 << 29) /* Bit 29: Independent Watchdog reset flag */
#define RCC_RSR_WWDGRSTF                 (1 << 30) /* Bit 30: Window watchdog reset flag */
#define RCC_RSR_LPWRRSTF                 (1 << 31) /* Bit 31: Low-Power reset flag */

