apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_rcc.h
/* Secure Configuration Register */

#define RCC_SECCFGR_HSISEC               (1 << 0)  /* HSI clock configuration and status bits security */
#define RCC_SECCFGR_HSESEC               (1 << 1)  /* HSE clock configuration and status bits security */
#define RCC_SECCFGR_CSISEC               (1 << 2)  /* CSI clock configuration and status bits security */
#define RCC_SECCFGR_LSISEC               (1 << 3)  /* LSI clock configuration and status bits security */
#define RCC_SECCFGR_LSESEC               (1 << 4)  /* LSE clock configuration and status bits security */
#define RCC_SECCFGR_SYSCLKSEC            (1 << 5)  /* SYSCLK configuration and status bits security */
#define RCC_SECCFGR_PRESCSEC             (1 << 6)  /* PRESC configuration and status bits security */
#define RCC_SECCFGR_PLL1SEC              (1 << 7)  /* PLL1 configuration and status bits security */
#define RCC_SECCFGR_PLL2SEC              (1 << 8)  /* PLL2 configuration and status bits security */
#define RCC_SECCFGR_PLL3SEC              (1 << 9)  /* PLL3 configuration and status bits security */
#define RCC_SECCFGR_HSI48SEC             (1 << 11) /* HSI48 configuration and status bits security */
#define RCC_SECCFGR_RMVRST               (1 << 12) /* Remove Reset flag security */
#define RCC_SECCFGR_CKPERSELSEC          (1 << 13) /* PER_CK selection security */

/* Privilege Configuration Register */

#define RCC_PRIVCFGR_SPRIV               (1 << 0) /* Secure functions privilege configuration */
#define RCC_PRIVCFGR_NSPRIV              (1 << 1) /* Non-secure functions privilege configuration */

#endif /* CONFIG_STM32_STM32H5XXXX */
#endif /* __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5XXX_RCC_H */
